NordicPlayground/nRF52-clients-for-serial-LTE-modem/slm_ble_app_uart/main.c
static void on_serial_evt(struct nrf_serial_s const * p_serial, nrf_serial_event_t event);

NRF_SERIAL_CONFIG_DEF(serial_config, NRF_SERIAL_MODE_IRQ,
                      &serial_queues, &serial_buffs, on_serial_evt, NULL);
NRF_SERIAL_UART_DEF(m_serial_uart, 0);


BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT);                                   /**< BLE NUS service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */

static uint16_t   m_conn_handle          = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */
static uint16_t   m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
    {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};

typedef struct
{
    uint8_t           length;                            /* actuall data length of this buffer block */
    uint8_t           data[DEV_CTRL_MAX_DATA_LEN];       /* max length of one data buffer */
} uart_buf_block_t;

static uart_buf_block_t         m_rx_buf;
static uint8_t                  m_rx_size     = 0;

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

void uart_rx_init(void)
{
  memset(m_rx_buf.data, 0x00, DEV_CTRL_MAX_DATA_LEN);
  m_rx_buf.length = 0x00;
  m_rx_size = 0;
}

void uart_data_receive(uart_buf_block_t * p_rx_buf)
{
  uint32_t err_code ;

  NRF_LOG_INFO("UART RECEIVE, length:%d.", p_rx_buf->length);
  NRF_LOG_HEXDUMP_INFO(p_rx_buf->data, p_rx_buf->length);

  if (strstr((char *)(p_rx_buf->data), SYNC_UP_MESSAGE))
  {
      NRF_LOG_INFO("Sync up");
      nrf_gpio_pin_set(WAKEUP_GPIO_PIN);
  }

  do
  {
    uint16_t length = p_rx_buf->length;
    err_code = ble_nus_data_send(&m_nus, p_rx_buf->data, &length, m_conn_handle);
    if ((err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != NRF_ERROR_NOT_FOUND))
    {
       APP_ERROR_CHECK(err_code);
    }
  } while (err_code == NRF_ERROR_RESOURCES);

  // prepare for next receive
  uart_rx_init();
}

static void serial_receive_data(nrf_serial_t const * p_serial)
{
  // Invalid protocol packet size
  static uint8_t size_to_receive = DEV_CTRL_MAX_DATA_LEN+1;

  nrf_queue_t const * p_rxq = p_serial->p_ctx->p_config->p_queues->p_rxq;
  m_rx_size += nrf_queue_out(p_rxq, &m_rx_buf.data[m_rx_size], SERIAL_BUFF_RX_SIZE);

  if (m_rx_size > 2)
  {
    /*AT responses are always terminated with <CR><LF> */
    if ((m_rx_buf.data[m_rx_size-2] == '\r') &&
        (m_rx_buf.data[m_rx_size-1] == '\n'))
        {
          m_rx_buf.length = m_rx_size;
          uart_data_receive(&m_rx_buf);
        }
  }
  if (m_rx_size >= size_to_receive)
  {
    m_rx_buf.length = size_to_receive;
    uart_data_receive(&m_rx_buf);
  }
}

static void on_serial_evt(nrf_serial_t const * p_serial, nrf_serial_event_t event)
{
  switch (event)
  {
    case NRF_SERIAL_EVENT_TX_DONE:
      NRF_LOG_DEBUG("NRF_SERIAL_EVENT_TX_DONE");
      break;

    case NRF_SERIAL_EVENT_RX_DATA:
      NRF_LOG_DEBUG("NRF_SERIAL_EVENT_RX_DATA");
      serial_receive_data(p_serial);
      break;

    case NRF_SERIAL_EVENT_DRV_ERR:
      NRF_LOG_ERROR("NRF_SERIAL_EVENT_DRV_ERR(0x%08x)", p_serial->p_ctx->error);
      // TO-DO reset UART RX by GPIO
      break;

    case NRF_SERIAL_EVENT_FIFO_ERR:
      NRF_LOG_ERROR("NRF_SERIAL_EVENT_FIFO_ERR");
      // TO-DO reset UART RX by GPIO
      break;

    default:
      break;
  }
}

uint32_t serial_connect_init(void)
{
  uart_rx_init();

  return nrf_serial_init(&m_serial_uart, &uart0_drv_config, &serial_config);
}

/**@brief Function for un-initialization */
uint32_t serial_connect_uninit(void)
{
  return nrf_serial_uninit(&m_serial_uart);
}

uint32_t inter_connect_send(const uint8_t *data_buff, uint8_t data_len)
{
  uint32_t ret_code;

  NRF_LOG_INFO("UART SEND, length:%d", data_len);
  NRF_LOG_HEXDUMP_INFO(data_buff, data_len);
  
  ret_code = nrf_serial_write(&m_serial_uart, data_buff, data_len, NULL, 0);
  if (ret_code != NRF_SUCCESS)
  {
    return ret_code;
  }

  return nrf_serial_flush(&m_serial_uart, 0);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{
    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);

        inter_connect_send(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
        inter_connect_send((const uint8_t *)CR_LF_TERMINATION, 2);
    }

